{
  "id": "audio-reverb",
  "title": "Reverb Effect",
  "description": "Add natural reverb to create space and depth",
  "pageTitle": "Reverb Effect",
  "pageDescription": "Add natural reverb to create space and depth",
  "aboutTitle": "About Reverb Effect",
  "aboutDescription": "Reverb simulates the natural echo that occurs when sound reflects off surfaces in an acoustic space. It adds depth, warmth, and spatial dimension to audio recordings.",
  "category": "filters",
  "sections": [
    {
      "title": "Why Use This Tool?",
      "content": [
        "Create natural space around vocals, instruments, and voiceovers without complicated routing or expensive plugins.",
        "Clear controls for room size, decay, and damping help you match reverb to tempo and genre quickly.",
        "Great for podcasters and educators who want subtle ambience that keeps speech intelligible and engaging.",
        "Runs locally in your browser, so client recordings and pre-release mixes stay private while you experiment.",
        "Includes classic plate, hall, and room flavors so you can audition multiple spaces before committing in a DAW."
      ]
    },

    {
      "title": "Common Questions",
      "content": [
        "<strong>Q:</strong> How much reverb should I use on vocals? <strong>A:</strong> Start with short rooms, under 1.5s decay, and adjust pre-delay (40-80ms) so words stay clear.",
        "<strong>Q:</strong> What’s the difference between plate and hall reverb? <strong>A:</strong> Plates sound bright and dense, great for vocals; halls are larger, smoother, and fit orchestral or cinematic mixes.",
        "<strong>Q:</strong> How do I avoid muddy mixes? <strong>A:</strong> Roll off lows on the reverb send (below 150Hz) and keep wet levels moderate, especially on bass-heavy material.",
        "<strong>Q:</strong> Can I use reverb on podcasts? <strong>A:</strong> Yes—apply subtle room or plate settings for warmth, and keep the wet mix under 15% to maintain intelligibility.",
        "<strong>Q:</strong> Should reverb be before or after compression? <strong>A:</strong> Typically after compression so the compressor doesn’t pump the reverb tail unnaturally."
      ]
    },

    {
      "title": "When to Use Reverb",
      "content": [
        "Vocals: Add warmth and presence to dry vocal recordings",
        "Instruments: Create spatial depth for guitars, pianos, and drums",
        "Podcasts: Subtle reverb can make voices sound more natural",
        "Music Production: Blend instruments together in a mix",
        "Sound Design: Create atmospheric and cinematic effects"
      ]
    },
    {
      "title": "Reverb Types",
      "content": [
        "<strong>Room Reverb:</strong> Simulates small to medium rooms",
        "<strong>Hall Reverb:</strong> Large concert hall acoustics",
        "<strong>Plate Reverb:</strong> Vintage mechanical reverb sound",
        "<strong>Spring Reverb:</strong> Classic guitar amp reverb",
        "<strong>Chamber Reverb:</strong> Echo chamber acoustics"
      ]
    },
    {
      "title": "Tips for Using Reverb",
      "content": [
        "Less is often more - start with subtle amounts",
        "Use pre-delay to separate the dry signal from reverb",
        "High-cut the reverb to avoid muddiness",
        "Match reverb time to the tempo of your music",
        "Use different reverb settings for different instruments"
      ]
    },

    {
      "title": "Pro Tips & Best Practices",
      "content": [
        "💡 Time the decay to your track tempo: for 120BPM, a 1-1.5s decay often keeps mixes tight while adding depth.",
        "💡 Use pre-delay to preserve consonants on vocals; 60-80ms creates separation without sounding detached.",
        "💡 Automate reverb sends on transitions—more on choruses, less on verses—to add dynamics without clutter.",
        "💡 Keep low frequencies dry by high-passing the reverb return; this prevents kick and bass from smearing.",
        "💡 For cinematic sound design, layer a short plate with a long hall to blend intimacy and scale."
      ]
    },

    {
      "title": "When to Use This Tool",
      "content": [
        "Singer-songwriters giving bedroom vocals a polished, studio-like sense of space without heavy mixing knowledge.",
        "Voiceover artists adding subtle ambience to narration so it feels present but not bone-dry.",
        "Film and game sound designers matching dialogue or foley to on-screen environments like tunnels, halls, or small rooms.",
        "Content creators smoothing abrupt cuts between takes by blending room tone with short, consistent reverbs.",
        "Live streamers softening harsh microphones while keeping speech intelligible for viewers."
      ]
    },

    {
      "title": "Related Tools",
      "content": [
        "Shape tone before adding space with the <a href=\"/audio-equalizer\">Audio Equalizer</a> for cleaner reverb tails.",
        "Reduce background noise using <a href=\"/audio-noise-reduction\">Noise Reduction</a> so room reflections highlight only the desired signal.",
        "Balance peaks after ambience with <a href=\"/audio-normalize\">Normalize Audio</a> to meet platform loudness standards.",
        "Create rhythmic throws with <a href=\"/audio-echo\">Echo Effect</a>, then blend with reverb for lush stereo textures."
      ]
    }
  ]
}