{
  "id": "password-generator",
  "title": "Password Generator",
  "description": "Generate strong, secure passwords with customizable options",
  "pageTitle": "Password Generator",
  "pageDescription": "Generate strong, secure passwords with customizable options",
  "aboutTitle": "About Password Generator",
  "aboutDescription": "Generate strong, secure passwords with customizable character types and length. Essential for protecting your online accounts with unique, hard-to-crack passwords.",
  "category": "helpful-calculators",
  "sections": [
    {
      "title": "Password Strength Factors",
      "content": [
        "Length: Longer passwords are exponentially harder to crack",
        "Character Variety: Mix uppercase, lowercase, numbers, and symbols",
        "Randomness: Avoid patterns, dictionary words, and personal information",
        "Uniqueness: Use different passwords for each account",
        "Unpredictability: Don't use common substitutions like @ for a"
      ]
    },
    {
      "title": "Recommended Settings",
      "content": [
        "Minimum 12 characters for general accounts",
        "16+ characters for sensitive accounts (banking, email)",
        "Include all character types for maximum security",
        "Avoid passwords shorter than 8 characters",
        "Consider 20+ characters for critical systems"
      ]
    },
    {
      "title": "Password Security Tips",
      "content": [
        "Use at least 12-16 characters for strong passwords",
        "Include a mix of uppercase, lowercase, numbers, and symbols",
        "Avoid using personal information or common words",
        "Use a unique password for each account",
        "Consider using a password manager to store passwords securely"
      ]
    },
    {
      "title": "Why Use This Tool?",
      "content": [
        "✓ <strong>Reduce Breach Risk:</strong> Instantly create random credentials that are resistant to dictionary and brute-force attacks.",
        "✓ <strong>Compliance Ready:</strong> Meet corporate length and complexity policies without manual guesswork.",
        "✓ <strong>Shared Standards:</strong> Generate and share password guidelines with teammates so everyone follows the same security baseline.",
        "✓ <strong>Faster Onboarding:</strong> Create strong credentials during account setup without reusing weak personal passwords.",
        "✓ <strong>Audit Support:</strong> Document password policies and sample outputs to demonstrate security hygiene."
      ]
    },
    {
      "title": "Common Questions",
      "content": [
        "<strong>Q: How long should passwords be?</strong><br>Use at least 12 characters for everyday accounts and 16+ for financial, email, or admin access. Longer is always stronger when paired with randomness.",
        "<strong>Q: Are passphrases better?</strong><br>Passphrases made of random words (e.g., horse-battery-window-cloud) can be strong if long enough. Add numbers and symbols for extra entropy and avoid famous quotes or lyrics.",
        "<strong>Q: Can I reuse a strong password?</strong><br>No. Even great passwords should be unique per site to prevent a single breach from compromising multiple accounts.",
        "<strong>Q: How should I store passwords?</strong><br>Use a reputable password manager. Avoid spreadsheets or email drafts, and never write admin credentials on sticky notes.",
        "<strong>Q: What about 2FA?</strong><br>Always pair strong passwords with two-factor authentication (authenticator apps or hardware keys) for critical services."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "content": [
        "💡 <strong>Length First:</strong> If you must choose, increasing length adds more security than adding extra symbols after a point.",
        "💡 <strong>Service-Specific Rules:</strong> Some sites forbid certain symbols—generate, then adjust minimally while keeping length and variety.",
        "💡 <strong>Rotation Strategy:</strong> Rotate only high-risk credentials regularly (admin, database, banking); rotating everything too often can lead to unsafe reuse.",
        "💡 <strong>Offline Copies:</strong> Keep emergency recovery codes in a secure offline location like a safe, not in the same place as your devices.",
        "💡 <strong>Shared Accounts:</strong> If you must share, generate a strong password and distribute via a secure channel, then rotate after the project ends."
      ]
    },
    {
      "title": "When to Use This Tool",
      "content": [
        "<strong>New Account Setup:</strong> Creating fresh credentials for banking, email, cloud services, or SaaS tools.",
        "<strong>Incident Response:</strong> Rotating passwords after a breach notification or when an employee departs.",
        "<strong>Vendor Access:</strong> Issuing temporary but strong credentials for contractors and disabling them after use.",
        "<strong>Shared Devices:</strong> Generating lock screen or BIOS passwords with high entropy to deter physical access.",
        "<strong>Policy Documentation:</strong> Capturing example outputs when updating security playbooks."
      ]
    },
    {
      "title": "Related Tools",
      "content": [
        "Need unique usernames too? Pair this with the <a href='/helpful-calculators/cheatsheet-builder'>Cheatsheet Builder</a> to document account setup steps.",
        "Sharing credentials securely? Use encrypted channels and keep a record in your <a href='/helpful-calculators/cheatsheet-builder'>Cheatsheet Builder</a> exports.",
        "Tracking logins across services? Add links to the relevant portals within your exported cheat sheets or team wikis.",
        "Coordinating across time zones? Securely share meeting access details with the <a href='/helpful-calculators/timezone-converter'>Timezone Converter</a> for scheduling."
      ]
    }
  ]
}