{
  "id": "sunburst-chart",
  "title": "Sunburst Chart Generator",
  "description": "Create hierarchical sunburst charts to visualize nested data structures",
  "pageTitle": "Sunburst Chart Generator",
  "pageDescription": "Create hierarchical sunburst charts to visualize nested data structures. Sunburst charts are ideal for showing hierarchical relationships and proportions.",
  "chartDataTitle": "Chart Data",
  "chartDataDescription": "Configure your sunburst chart using hierarchical JSON data",
  "exampleJson": "{\n  \"title\": \"Organization Structure\",\n  \"data\": {\n    \"name\": \"Company\",\n    \"children\": [\n      {\n        \"name\": \"Engineering\",\n        \"children\": [\n          { \"name\": \"Frontend\", \"value\": 30 },\n          { \"name\": \"Backend\", \"value\": 40 },\n          { \"name\": \"DevOps\", \"value\": 20 }\n        ]\n      },\n      {\n        \"name\": \"Sales\",\n        \"children\": [\n          { \"name\": \"Enterprise\", \"value\": 50 },\n          { \"name\": \"SMB\", \"value\": 30 }\n        ]\n      },\n      {\n        \"name\": \"Marketing\",\n        \"children\": [\n          { \"name\": \"Content\", \"value\": 25 },\n          { \"name\": \"Social\", \"value\": 15 },\n          { \"name\": \"SEO\", \"value\": 20 }\n        ]\n      }\n    ]\n  }\n}",
  "exampleData": {
    "title": "Organization Structure",
    "data": {
      "name": "Company",
      "children": [
        {
          "name": "Engineering",
          "children": [
            { "name": "Frontend", "value": 30 },
            { "name": "Backend", "value": 40 },
            { "name": "DevOps", "value": 20 }
          ]
        },
        {
          "name": "Sales",
          "children": [
            { "name": "Enterprise", "value": 50 },
            { "name": "SMB", "value": 30 }
          ]
        },
        {
          "name": "Marketing",
          "children": [
            { "name": "Content", "value": 25 },
            { "name": "Social", "value": 15 },
            { "name": "SEO", "value": 20 }
          ]
        }
      ]
    }
  },
  "category": "charts",
  "sections": [
    {
      "title": "Why Use This Tool?",
      "type": "list",
      "content": [
        "✓ Visualize multi-level hierarchies in compact radial space showing parent-child relationships - sunburst charts display 3-6 hierarchy levels in single view (company → division → department → team) where traditional tree diagrams require scrolling, perfect for organizational charts, file systems, taxonomies where understanding structure across multiple depths matters for strategic planning or navigation optimization",
        "✓ Show proportions at every hierarchy level simultaneously for budget analysis - each ring shows how parent category divides into children with arc size representing proportion, instantly see 'Marketing is 30% of company' AND 'Social Media is 50% of Marketing' in one glance, enabling multi-level budget reviews, resource allocation discussions, cost driver analysis without switching between multiple pie charts or tables",
        "✓ Enable interactive drill-down exploration for large datasets with 100+ leaf nodes - click outer ring segment to zoom and recenter, making that segment the new root with its children expanded, allows exploring massive hierarchies (entire product catalog, full org chart, complete file system) by starting at top level and progressively drilling into areas of interest without overwhelming with too much detail initially",
        "✓ Compare sibling categories visually at each level for competitive positioning - segments at same ring level are siblings under same parent, arc sizes enable direct comparison (Frontend team vs Backend team both under Engineering), color intensity can show metrics (profitability, growth rate), reveals imbalances like 'one division consumes 80% of resources' or 'three products generate 90% of revenue' guiding strategic resource reallocation",
        "✓ 100% client-side processing protects organizational structure intelligence - safely visualize confidential org charts showing headcount by department, revenue breakdowns revealing profit centers, cost structures exposing margin details, product portfolio composition indicating strategic priorities without uploading sensitive competitive intelligence to external visualization platforms where data breaches could expose business strategy"
      ]
    },
    {
      "title": "When to Use Sunburst Charts",
      "type": "list",
      "content": [
        "Visualizing hierarchical data",
        "Showing nested proportions",
        "Displaying organizational structures",
        "File system or category breakdowns"
      ]
    },
    {
      "title": "Data Structure",
      "type": "code",
      "content": [
        "{",
        "  \"title\": \"Organization Structure\",",
        "  \"data\": {",
        "    \"name\": \"Company\",",
        "    \"children\": [",
        "      {",
        "        \"name\": \"Engineering\",",
        "        \"children\": [",
        "          { \"name\": \"Frontend\", \"value\": 30 }",
        "        ]",
        "      }",
        "    ]",
        "  }",
        "}"
      ]
    },
    {
      "title": "Common Questions",
      "type": "list",
      "content": [
        "<strong>Q: When should I use a sunburst chart instead of a treemap or traditional tree diagram?</strong> Sunburst vs Treemap: Sunburst uses radial layout with concentric rings, emphasizes hierarchy levels (clear depth), compact but harder to compare exact sizes, visually striking for presentations. Treemap uses rectangular tiles, optimizes space efficiency, easier size comparison (rectangle area), less obvious hierarchy depth. Use sunburst when: hierarchy depth is key insight (organization structure showing clear levels), aesthetic matters (radial looks sophisticated), 3-6 levels (readable rings). Use treemap when: space is limited (fits more leaf nodes), precise size comparison needed (revenue by product), many leaf nodes with shallow hierarchy (100 products in 3 categories). Sunburst vs Tree Diagram: Tree shows connections explicitly (lines between nodes), handles non-proportional hierarchies (org chart where node size doesn't matter), unlimited width/depth. Sunburst shows proportions (arc size = value), limited to circular space, requires numeric values for all nodes. Use tree when: relationships matter more than size, extremely deep/wide hierarchies, nodes have no quantitative value. Verdict: sunburst = proportional hierarchies with clear levels, treemap = space-constrained size comparison, tree = relationship focus.",
        "<strong>Q: How many hierarchy levels can I effectively show in a sunburst chart?</strong> Practical limits: 3-6 levels depending on segment count and label length. 2 levels: too simple (use pie chart instead), sunburst adds complexity without benefit. 3-4 levels (ideal): rings readable, labels fit, clear hierarchy, sufficient for most business hierarchies (company → division → department → team). 5-6 levels (maximum): outer rings become thin (hard to see, click, label), works only if inner levels have few segments (5-10), enables exploration with zoom/drill-down interaction. 7+ levels: outer rings unusable (slivers), labels overlap completely, data better suited for zoomable treemap or expandable tree. Segment count matters: 3 levels with 10 segments each (1000 leaf nodes total) more challenging than 5 levels with 3 segments each (243 leaf nodes). Design rule: if outer ring segments are less than 2 degrees arc (360°/180 = 2°), too thin to be useful. Interactive sunbursts handle more depth by allowing click-to-zoom (outer rings hidden until parent clicked).",
        "<strong>Q: Should I use uniform or variable colors for hierarchy levels in sunburst charts?</strong> Color strategies for hierarchical data: (1) Sequential by level - all ring 1 segments blue shades, ring 2 green shades, ring 3 orange shades - clearly distinguishes depth but loses relationship between parent and children. (2) Inherited/gradient from parent - children inherit parent color with variation (parent blue → children light blue, medium blue, dark blue) - shows family relationships, maintains visual grouping. (3) Category-based - all Engineering segments blue (regardless of level), all Sales segments green, all Marketing orange - emphasizes top-level categories, maintains color across levels. Best practice: inherited/gradient most common (D3.js default), balances hierarchy visibility with relationship clarity. Implementation: parent color → children get tints/shades (lighten/darken parent), or parent hue → children shift hue slightly. Avoid: random colors (loses structure), too similar colors (can't distinguish siblings), rainbow spectrum (no semantic meaning). Include colorblind-friendly palettes or allow pattern overlays (stripes, dots) for accessibility.",
        "<strong>Q: How do I handle labels in sunburst charts without overlapping or clutter?</strong> Label challenges: outer rings have many small segments, curved text harder to read than straight, long labels don't fit in narrow arcs. Solutions: (1) Truncate + tooltips - show abbreviated labels on chart ('Eng...', 'Mkt...'), full labels on hover tooltip (best for interactive). (2) Hierarchical abbreviation - inner rings get full labels (space available), outer rings get codes/icons (outer ring 'FE' with parent context 'Engineering' from inner ring). (3) Selective labeling - only label segments above size threshold (>5% of ring), skip tiny segments, include legend or companion list for full names. (4) Radial text - text follows arc curve, readable for large segments (45°+), skip for tiny arcs (<10°). (5) External labels - connect outer segments to labels outside circle with leader lines (clutters but ensures readability). (6) Drill-down navigation - show only 2-3 levels at once, clicking segment recenters to show its children in detail (handles unlimited depth). Best practice: interactive sunbursts combine truncation (short labels on chart) + tooltips (full detail on hover) + zoom (drill into segments for focus).",
        "<strong>Q: Can sunburst charts show negative values or only positive hierarchical data?</strong> Sunburst charts fundamentally designed for positive proportional hierarchies (arc size = magnitude), negative values break the model. Why negatives don't work: (1) Arc size must be positive (can't have negative angle in circle). (2) Proportional meaning: each child is portion of parent total - negative child implies negative contribution which is conceptually confusing in nested context. (3) Parent = sum of children - if children can be negative, parent calculation becomes ambiguous. Scenarios with negatives: profit/loss by department (some departments lose money), budget variance (over/under budget), change metrics (growth/decline). Alternatives for negative values: (1) Use treemap with diverging colors (red tiles = losses, green = profits), tile size = absolute value. (2) Show two separate sunbursts (one for positive, one for negative). (3) Use traditional tree diagram where node labels show +/- without size encoding. (4) Use stacked bar chart for hierarchy with diverging bars. Bottom line: if your data has negative values, sunburst is wrong chart type - choose visualization that can represent signed values meaningfully."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "type": "list",
      "content": [
        "💡 <strong>Use color intensity or saturation to encode additional metrics beyond size:</strong> Dual encoding strategy: arc size represents primary metric (budget, headcount, revenue), color intensity represents secondary metric (profitability, growth rate, efficiency). Example: revenue by product category sunburst where arc size = total revenue, color intensity = profit margin (dark green = high margin 40%+, light green = low margin 10%). Implementation: create color scale (gradient from light to dark within each category family), map metric values to scale, apply to segments. Benefits: reveals patterns like 'large low-margin categories' vs 'small high-margin niches', supports strategic decisions (invest in high-margin areas), adds analytical depth without additional charts. Caution: don't overload (2 metrics maximum via size + color), include clear legend explaining color scale, ensure accessibility (don't rely solely on color, add patterns or labels).",
        "💡 <strong>Implement breadcrumb navigation showing current drill-down path:</strong> Breadcrumbs = text path showing hierarchy position after zooming (Company > Engineering > Backend > API Team), typically displayed above chart. Benefits: user orientation (prevents getting lost in deep hierarchies), easy navigation back to parent levels (click breadcrumb segment), communicates current context for screenshots/sharing. Implementation: update breadcrumb on each click-to-zoom, make each breadcrumb segment clickable (click 'Engineering' to return to Engineering view), show full path from root to current focus, style current segment distinctly (bold, different color). Best practice: combine breadcrumbs with 'zoom out' or 'reset' button, show path labels even if chart labels are abbreviated, include in exported images for context. Example breadcrumb: 'Company (100M) > Engineering (30M) > Backend (12M)' with values showing context at each level.",
        "💡 <strong>Add center circle label showing current selection context and total value:</strong> Center circle (empty space at sunburst center) = prime real estate for contextual information. Display options: (1) Static mode: root category name + total value ('Total Budget: $10M', 'Organization: 500 employees'). (2) Interactive mode: on hover, show segment details (segment name, value, percentage of parent, absolute percentage of root). (3) Drill-down mode: after clicking segment, show current focus name + value ('Engineering Dept: $3M, 30% of Total'). Benefits: utilizes otherwise empty space, provides reference point, shows selection feedback, adds quantitative precision to visual proportions. Styling: center text larger than segment labels (hierarchical typography), use multiple lines if needed (category name on one line, value on second), subtle background circle or gradient to distinguish from segments. Update dynamically on interaction (hover, click, zoom).",
        "💡 <strong>Order segments by size (largest to smallest) for easier comparison:</strong> Segment ordering within each ring affects readability and comparison ease. Sorting strategies: (1) Clockwise by size (largest at 12 o'clock, decreasing clockwise) - easiest to identify top categories, natural reading order for Western audiences. (2) Maintain data order (alphabetical, chronological, custom) - use when order has meaning (months in sequence, workflow stages). (3) Group related segments together even if different sizes - use when categorical relationship matters (group all product lines even if different revenue). Default recommendation: sort by size descending clockwise unless data has inherent order. Benefits: largest segments (most important) get most visible position, enables 'top N' analysis at glance, comparison easier when sizes monotonically decrease. Implementation: pre-sort data before rendering (sort children array by value), consistent sorting across all hierarchy levels. Special case: if one segment dominates (>50%), consider placing it at bottom (6 o'clock position) to prevent visual imbalance.",
        "💡 <strong>Provide both proportional and absolute value displays for context:</strong> Challenge: sunburst shows proportions (arc size) but absolute values often more meaningful for decisions. Display both: (1) Arc size = proportion (visual encoding, no labels needed). (2) Tooltips show absolute values ('Engineering: $3M (30% of $10M total)'). (3) Center label shows running total or selection value. (4) Breadcrumb shows absolute values in path ('Company: $10M > Engineering: $3M > Backend: $1.2M'). Why both matter: 'Backend is 40% of Engineering' (proportion) + 'Backend is $1.2M' (absolute) together enable decisions - 40% sounds big, but $1.2M absolute context matters if total budget is $100M vs $3M. Include calculation in tooltips: show value, percentage of immediate parent, percentage of root (e.g., 'Backend: $1.2M, 40% of Engineering, 12% of Company'). Prevents misinterpretation where large arc in outer ring represents small absolute portion of total."
      ]
    },
    {
      "title": "When to Use This Tool",
      "type": "list",
      "content": [
        "<strong>Organizational Structure & Workforce Analysis:</strong> Visualize company hierarchy showing headcount distribution from C-suite to individual teams, display department budgets breaking down from division level to team level revealing resource allocation patterns, show salary costs hierarchically revealing which departments and roles consume most compensation budget, analyze organizational changes over time comparing sunbursts before/after restructuring to communicate headcount reallocation impact to stakeholders",
        "<strong>Budget & Financial Allocation:</strong> Break down annual budget from top-level categories (operations, marketing, R&D) through sub-categories to line items, visualize cost structures showing how product costs decompose into materials, labor, overhead at multiple levels, display revenue attribution from total revenue through business units, product lines, to individual SKUs revealing profit center hierarchy, track spending patterns showing where money goes from department allocation to actual expenses enabling drill-down investigation of overages",
        "<strong>File Systems & Storage Management:</strong> Visualize disk usage showing directory hierarchy from root to nested folders revealing space hogs, display cloud storage costs breaking down from account level through projects, buckets, to individual file types, analyze code repositories showing module hierarchy with sizes indicating line count or complexity, identify storage optimization opportunities by drilling into largest segments to find deletable or archivable content at detail level",
        "<strong>E-commerce & Product Taxonomy:</strong> Display product catalog hierarchy from departments through categories, subcategories, to individual products showing inventory distribution, visualize sales revenue hierarchically revealing which product families, categories, and specific items contribute most to total, analyze profit margins across product hierarchy using color intensity to show margins while arc size shows revenue enabling margin-weighted portfolio decisions, show search taxonomy breaking down how users navigate category trees to reach products informing information architecture improvements",
        "<strong>Website Analytics & Content Structure:</strong> Visualize site hierarchy showing page views distribution from homepage through sections, categories, to individual pages, display user flow through site levels revealing most common navigation paths and drop-off points in hierarchical site structure, analyze content contribution showing how content categories and individual pieces contribute to engagement metrics like time-on-site or conversions, identify content gaps or overinvestment by comparing sibling categories in sunburst revealing imbalanced content distribution",
        "<strong>Scientific Taxonomy & Classification:</strong> Display biological taxonomy from kingdom through phylum, class, order, family, genus to species showing proportional representation in dataset, visualize chemical compound classification hierarchically organizing by functional groups and specific compounds for inventory management, show disease classification breaking down from broad categories through specific diagnoses with prevalence data, organize research literature taxonomically showing how papers distribute across fields, subfields, and specific topics enabling gap analysis in literature reviews"
      ]
    },
    {
      "title": "Related Tools",
      "type": "list",
      "content": [
        "Try our <a href='/charts/pie-chart'>Pie Chart Generator</a> for simple single-level proportional comparisons without hierarchy",
        "Use our <a href='/charts/bar-chart'>Bar Chart Generator</a> for comparing hierarchical categories in flat linear layout",
        "Check our <a href='/dev-tools/json-formatter'>JSON Formatter</a> to validate and format hierarchical data structures",
        "Explore our <a href='/dev-tools/csv-formatter'>CSV Formatter</a> to prepare nested data from spreadsheets for visualization"
      ]
    }
  ]
}
