{
  "id": "bmi",
  "title": "BMI Calculator",
  "description": "Calculate your Body Mass Index and understand your weight category",
  "aboutDescription": "Body Mass Index (BMI) is a measure of body fat based on height and weight. It's widely used as a screening tool to identify potential weight problems.",
  "icon": "Heart",
  "resultTitle": "Your Results",
  "category": "calculators",
  "fields": [
    {
      "name": "weight",
      "label": "Weight",
      "type": "number",
      "placeholder": "Enter weight",
      "required": true,
      "min": 20,
      "max": 500,
      "helpText": "Your weight"
    },
    {
      "name": "weightUnit",
      "label": "Weight Unit",
      "type": "select",
      "options": [
        {
          "value": "kg",
          "label": "Kilograms (kg)"
        },
        {
          "value": "lbs",
          "label": "Pounds (lbs)"
        }
      ],
      "required": true
    },
    {
      "name": "height",
      "label": "Height",
      "type": "number",
      "placeholder": "Enter height",
      "required": true,
      "min": 50,
      "max": 300,
      "helpText": "Your height"
    },
    {
      "name": "heightUnit",
      "label": "Height Unit",
      "type": "select",
      "options": [
        {
          "value": "cm",
          "label": "Centimeters (cm)"
        },
        {
          "value": "in",
          "label": "Inches (in)"
        }
      ],
      "required": true
    }
  ],
  "sections": [
    {
      "title": "Why Use This Tool?",
      "type": "list",
      "content": [
        "✓ Instant BMI calculation with automatic category classification (Underweight, Normal, Overweight, Obese)",
        "✓ Supports both metric (kg, cm) and imperial (lbs, inches) measurements for international users",
        "✓ Based on WHO and CDC standards used by healthcare professionals worldwide",
        "✓ Includes personalized health advice and recommendations for each BMI category",
        "✓ Completely private - all calculations happen in your browser with no data stored or transmitted"
      ]
    },
    {
      "title": "Formula",
      "type": "list",
      "content": [
        "BMI (metric): $\\text{BMI} = \\frac{\\text{weight (kg)}}{\\text{height (m)}^2}$",
        "BMI (imperial): $\\text{BMI} = \\frac{\\text{weight (lbs)} \\times 703}{\\text{height (in)}^2}$"
      ]
    },
    {
      "title": "BMI Categories",
      "type": "list",
      "content": [
        "<strong>Underweight:</strong> BMI less than 18.5",
        "<strong>Normal weight:</strong> BMI 18.5-24.9",
        "<strong>Overweight:</strong> BMI 25-29.9",
        "<strong>Obese:</strong> BMI 30 or greater"
      ]
    },
    {
      "title": "Important Notes",
      "type": "list",
      "content": [
        "BMI is a screening tool, not a diagnostic tool",
        "It doesn't account for muscle mass, bone density, or body composition",
        "Athletes and bodybuilders may have high BMI due to muscle mass, not excess fat",
        "Always consult healthcare professionals for personalized advice"
      ]
    },
    {
      "title": "Common Questions",
      "type": "list",
      "content": [
        "<strong>Q: Is BMI accurate for everyone?</strong> No, BMI has limitations. It doesn't distinguish between muscle and fat, so athletes with high muscle mass may be classified as overweight despite being healthy. It also doesn't account for age, gender, bone density, or fat distribution. BMI is best used as a screening tool - if your BMI is concerning, see a doctor for body composition analysis.",
        "<strong>Q: What's a healthy BMI range?</strong> For most adults, a BMI between 18.5 and 24.9 is considered healthy. However, 'healthy' varies by ethnicity - Asian populations have higher health risks at lower BMIs, so some guidelines suggest 18.5-23 for Asians. Age also matters - slightly higher BMI (25-27) may be healthier for adults over 65. Always consult your doctor.",
        "<strong>Q: Why does the imperial formula multiply by 703?</strong> The constant 703 converts the imperial units (pounds and inches) to match the metric formula's scale. Without it, BMI calculated with pounds/inches would give a much smaller number. The 703 factor was chosen to make imperial BMI values align with metric BMI values.",
        "<strong>Q: Can I use BMI to track weight loss progress?</strong> Yes, but use it alongside other metrics. BMI tracks overall weight changes but doesn't show if you're losing fat or muscle. Combine BMI tracking with waist circumference measurements, body fat percentage, and how your clothes fit. Take progress photos and track strength/endurance improvements too.",
        "<strong>Q: When should I see a doctor about my BMI?</strong> Consult a healthcare provider if your BMI is below 18.5 (underweight) or above 30 (obese), if you've had rapid weight changes (±10 lbs in a month), if you have obesity-related symptoms (sleep apnea, joint pain, difficulty breathing), or if you're planning significant weight changes. Your doctor can assess your overall health beyond just BMI."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "type": "list",
      "content": [
        "💡 <strong>Measure consistently:</strong> Weigh yourself at the same time each day (ideally morning, after bathroom, before eating) wearing similar clothing. Weight fluctuates 2-5 lbs daily due to water retention, food, and timing.",
        "💡 <strong>Track trends, not single measurements:</strong> Don't obsess over one BMI reading. Track weekly averages over months. Temporary weight gain from salty meal or hard workout doesn't mean you've gained fat - look at the overall trend.",
        "💡 <strong>Use BMI with other metrics:</strong> Measure waist circumference (health risk increases if >40 inches for men, >35 inches for women regardless of BMI), track body fat percentage, and monitor fitness levels. A runner and couch potato can have same BMI but very different health.",
        "💡 <strong>Understand muscle weighs more than fat:</strong> If you're strength training, you might gain weight while getting healthier. Muscle is denser than fat, so you can lose fat, gain muscle, stay same weight, but look and feel better. Use a tape measure and photos alongside BMI.",
        "💡 <strong>BMI doesn't equal health:</strong> You can be 'normal weight' but unhealthy (poor diet, no exercise), or 'overweight' but very healthy (muscular, active). Focus on healthy behaviors - nutritious food, regular exercise, adequate sleep, stress management - rather than hitting a specific BMI number."
      ]
    },
    {
      "title": "When to Use This Tool",
      "type": "list",
      "content": [
        "<strong>Health Screenings:</strong> Initial assessment of weight status before deeper health evaluations or lifestyle changes",
        "<strong>Weight Management:</strong> Tracking progress during weight loss or weight gain programs over weeks and months",
        "<strong>Fitness Goals:</strong> Setting realistic body composition targets for general fitness (but use body fat % for athletic goals)",
        "<strong>Medical Appointments:</strong> Preparing for doctor visits by knowing your BMI category to discuss health implications",
        "<strong>Insurance Applications:</strong> Some health and life insurance companies use BMI in their underwriting assessments",
        "<strong>Research Participation:</strong> Many health studies use BMI as an inclusion/exclusion criterion for participants"
      ]
    },
    {
      "title": "How to Use (Example + FAQs)",
      "type": "list",
      "content": [
        "<strong>Example:</strong> Enter weight 180 lbs and height 70 in, then submit. The calculator returns BMI 25.8 and places the result in the Overweight range.",
        "<strong>Step-by-step:</strong> (1) Choose your units. (2) Enter weight and height. (3) Review BMI and the category label.",
        "<strong>FAQ:</strong> <em>Is BMI a diagnosis?</em> No—it's a screening metric. Use it as a starting point and talk to a clinician for personalized guidance.",
        "<strong>FAQ:</strong> <em>Which units should I pick?</em> Use the units from your scale and tape measure to avoid conversion errors.",
        "<strong>FAQ:</strong> <em>Why does my BMI change day-to-day?</em> Small weight fluctuations from hydration or meals can shift BMI slightly."
      ]
    },
    {
      "title": "Related Tools",
      "type": "list",
      "content": [
        "Try our <a href='/calculators/calorie'>Calorie Calculator</a> to determine daily calorie needs based on your BMI category and weight goals",
        "Use our <a href='/calculators/protein'>Protein Calculator</a> to find optimal daily protein intake for your body weight and fitness level",
        "Check our <a href='/unit-conversions/mass'>Mass & Weight Converter</a> for converting between pounds and kilograms when using different scales",
        "Explore our <a href='/unit-conversions/length'>Length Converter</a> for converting height measurements between inches and centimeters"
      ]
    },
    {
      "title": "Quick Tips & Navigation",
      "type": "list",
      "content": [
        "Compare options in <a href=\"/calculators\">all calculators</a> when you need a different formula fast.",
        "Payments due? Use the <a href=\"/calculators/loan\">Loan & Mortgage Calculator</a> for schedules.",
        "Quick percent math lives in the <a href=\"/calculators/percentage\">Percentage Calculator</a>.",
        "Track durations with the <a href=\"/calculators/date-calculator\">Date Calculator</a> when timelines matter."
      ]
    }
  ]
}
