{
  "id": "usa-map",
  "title": "USA Map Chart Generator",
  "description": "Create choropleth maps to visualize data across US states",
  "pageTitle": "USA Map Chart Generator",
  "pageDescription": "Create choropleth maps to visualize data across US states. USA maps are ideal for showing geographic distributions and regional comparisons.",
  "chartDataTitle": "Chart Data",
  "chartDataDescription": "Configure your USA map with state-level data. Values determine circle size and color intensity.",
  "exampleJson": "{\n  \"title\": \"Population by State (millions)\",\n  \"data\": [\n    { \"state\": \"California\", \"value\": 39.5 },\n    { \"state\": \"Texas\", \"value\": 29.1 },\n    { \"state\": \"Florida\", \"value\": 21.5 },\n    { \"state\": \"New York\", \"value\": 19.8 },\n    { \"state\": \"Pennsylvania\", \"value\": 13.0 }\n  ]\n}",
  "exampleData": {
    "title": "Population by State (millions)",
    "data": [
      { "state": "California", "value": 39.5 },
      { "state": "Texas", "value": 29.1 },
      { "state": "Florida", "value": 21.5 },
      { "state": "New York", "value": 19.8 },
      { "state": "Pennsylvania", "value": 13.0 },
      { "state": "Illinois", "value": 12.8 },
      { "state": "Ohio", "value": 11.8 },
      { "state": "Georgia", "value": 10.7 },
      { "state": "North Carolina", "value": 10.4 },
      { "state": "Michigan", "value": 10.0 }
    ]
  },
  "category": "charts",
  "sections": [
    {
      "title": "Why Use This Tool?",
      "type": "list",
      "content": [
        "✓ Reveal geographic patterns invisible in tables or bar charts instantly - color-coded state maps expose regional clustering (Bible Belt conservatism, Rust Belt manufacturing decline, Sun Belt growth) that spreadsheet rows obscure, enabling strategic territory planning, market entry analysis, resource allocation decisions based on geographic concentration patterns rather than alphabetical state lists requiring mental geographic mapping",
        "✓ Compare state-level performance for 50 jurisdictions simultaneously in single view - visualize sales by state, customer acquisition by region, market penetration across territories seeing at glance which states outperform (dark colors) vs underperform (light colors) without scrolling through 50-row tables, perfect for quarterly business reviews, territory manager evaluations, expansion planning where geographic context matters as much as numeric ranking",
        "✓ Communicate demographic or economic trends to diverse audiences intuitively - everyone recognizes US state shapes even without labels, color intensity shows magnitude (darker = higher values) without requiring data literacy, enables presenting complex regional data (median income, vaccination rates, unemployment) to non-technical stakeholders like politicians, journalists, community groups where map visualization makes data accessible and persuasive",
        "✓ Identify market opportunities through regional gap analysis and saturation mapping - white/light states on choropleth indicate untapped markets, dark states show saturation, regional patterns suggest expansion strategies (coastal dominance suggests inland opportunity, clusters suggest network effects), competitive intelligence revealed through geographic market share visualization informing where to invest sales resources for maximum ROI in underserved territories",
        "✓ 100% client-side processing protects proprietary geographic intelligence - safely visualize confidential sales territory performance, customer density maps, market penetration rates, regional pricing strategies, expansion plans without uploading competitive geographic data to external mapping services where data breaches could expose where you're strong/weak enabling competitors to target your vulnerable markets or poach customers in underserved regions"
      ]
    },
    {
      "title": "When to Use USA Maps",
      "type": "list",
      "content": [
        "Showing geographic distributions",
        "Comparing data across states",
        "Visualizing regional patterns",
        "Displaying demographic or economic data by location"
      ]
    },
    {
      "title": "Data Structure",
      "type": "code",
      "content": [
        "{",
        "  \"title\": \"Population by State\",",
        "  \"data\": [",
        "    { \"state\": \"California\", \"value\": 39.5 },",
        "    { \"state\": \"Texas\", \"value\": 29.1 }",
        "  ]",
        "}"
      ]
    },
    {
      "title": "Common Questions",
      "type": "list",
      "content": [
        "<strong>Q: Should I use a choropleth map (color-filled states) or proportional symbol map (sized bubbles on states)?</strong> Choropleth map: fills entire state with color intensity representing value (darker = higher), emphasizes boundaries and regions, best for continuous data (rates, percentages, densities). Use when: showing per-capita metrics (income per person, crime rate per 100k), data naturally tied to geography (election results by state), comparing all 50 states. Limitation: visual bias toward large states (Alaska, Texas dominate visually even with low values). Proportional symbol/bubble map: places sized circle at state center, circle size = value magnitude, best for absolute quantities (total population, sales volume). Use when: showing counts/totals (number of stores, total revenue), avoiding geographic size bias (small Rhode Island can have large bubble), emphasizing top performers (large bubbles pop visually). Can combine: choropleth for primary metric (color = growth rate) + proportional symbols for secondary metric (size = market size). Most business dashboards: choropleth for rates/percentages, bubble for totals. Election maps typically: choropleth (red/blue states).",
        "<strong>Q: How do I choose color schemes for choropleth maps - sequential, diverging, or categorical?</strong> Three color scheme types: (1) Sequential (single hue gradient, light to dark) - for unidirectional data increasing from low to high (revenue, population, temperatures above zero). Example: light blue to dark blue for sales volume. Use when: data has natural progression, no meaningful midpoint, all positive values. (2) Diverging (two hues meeting at neutral middle) - for bidirectional data with critical midpoint (profit/loss, above/below average, election vote share). Example: red (Republican) to white (swing) to blue (Democrat) or red (below target) to white (on target) to green (above target). Use when: zero is meaningful (profit/loss), comparing to benchmark (above/below national average), showing opposing categories. (3) Categorical (distinct unrelated colors) - for discrete categories without order (regions: Northeast, Southeast, Midwest, West). Use when: data is nominal not ordinal. Best practice for business: sequential for metrics (darker = better performance), diverging for variance from target. Avoid: rainbow gradients (no semantic meaning), too many color steps (5-7 maximum distinguishable), red/green only (8% men are colorblind to red/green). Include: clear legend with value ranges for each color bin.",
        "<strong>Q: Should I show raw values or normalized per-capita data on state maps?</strong> Critical decision impacting interpretation: Raw values (absolute totals): show actual magnitude (California: 39M people, Wyoming: 580k people), reflect economic/market reality (more customers in populous states), useful for resource allocation (where to send most sales reps). Problem: dominated by population (California, Texas, Florida always darkest for most metrics), obscures per-capita insights (Alaska has highest income per capita but low total income). Normalized/per-capita values: divide by population (income per person, crimes per 100k residents, GDP per capita), reveals efficiency/intensity independent of size, enables apples-to-apples comparison (Mississippi vs Massachusetts median income). Problem: small states can have extreme per-capita values from small samples, doesn't reflect total market size. Best practice: choose based on question - 'Where are most customers?' needs raw totals, 'Which states have highest purchasing power?' needs per capita. Consider showing both: choropleth color = per capita rate, bubble size = absolute total. Always label clearly: '$50k per capita' vs '$2.1T total' to prevent misinterpretation.",
        "<strong>Q: How should I handle missing data for some states on the map?</strong> Missing data scenarios: not all states report data, some states excluded from analysis, data collection gaps. Visualization options: (1) No fill/white - leave states without data uncolored (white or light gray), clearly shows data gaps, prevents false information. Add note: 'Gray states: data not available'. (2) Distinct 'no data' color - use unique color (light gray, hashed pattern) different from data scale, distinguishes 'low value' from 'no value', include in legend. (3) Exclude from map - if only showing 10 states with data, don't show all 50, use alternative visualization (bar chart of 10 states). (4) Estimate/interpolate - only if statistically valid (neighboring states, historical trends), label as estimated, use different styling (transparency, hatching). Never: assign zero or lowest value to missing data (misrepresents reality), use same color as data range (implies actual measurement). Best practice: if 80%+ states have data, show full map with distinct 'no data' styling, if <50% have data, reconsider if map is appropriate visualization (scattered bar chart might be clearer).",
        "<strong>Q: What map projection should I use - Albers, Mercator, or equal area?</strong> Map projection = how 3D Earth surface translates to 2D screen, affects shape/size accuracy. Albers Equal Area Conic (most common for US): preserves relative state sizes accurately (critical for choropleth where color area = perception of magnitude), slight shape distortion acceptable, standard for US government maps, best for choropleth. Use this as default. Mercator: preserves shapes and angles (good for navigation), drastically inflates Alaska/northern states (Alaska appears 3x too large), misleading for data visualization. Avoid for choropleth. Equirectangular: simplest (latitude/longitude grid), extreme distortion at high latitudes, only acceptable for quick drafts. Lambert Conformal Conic: good balance of size/shape accuracy, alternative to Albers. For US state maps: Albers Equal Area with Alaska/Hawaii insets (scaled and repositioned below continental US) is standard - preserves all 50 states while maintaining readability. Bottom line: use Albers Equal Area for choropleth (size matters), only use other projections if you have specific cartographic reason. Most web mapping libraries default to appropriate projection."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "type": "list",
      "content": [
        "💡 <strong>Use continuous color gradients rather than discrete bins for smooth interpretation:</strong> Binning approaches: (1) Discrete bins/classes - group values into 5-7 ranges (0-20, 20-40, 40-60, etc.), each bin gets distinct color, creates visual 'steps', easier to categorize (this state is 'high' tier). (2) Continuous gradient - smooth color transition from min to max value, preserves nuance (slight differences visible), no arbitrary cutoff points. Recommendation: continuous for most business applications (subtle differences matter), discrete bins for categorical interpretation (low/medium/high tier classification). Binning methods if using discrete: equal interval (divide range evenly, can create bins with no states), quantile (equal number of states per bin, bins have different value ranges), natural breaks/Jenks (optimize breaks for data clustering). Label clearly: if using bins, show ranges in legend ('$40k-60k', '$60k-80k'), not just colors. Avoid: too many bins (>7 hard to distinguish), arbitrary round-number bins that don't match data distribution.",
        "💡 <strong>Include state labels or abbreviations for accessibility and clarity:</strong> Labeling challenge: 50 states, varying sizes (tiny Rhode Island vs huge Texas), limited space. Solutions: (1) Two-letter abbreviations on states (CA, TX, NY) - fits even small states, requires knowing abbreviations. (2) Full names on hover/tooltip - clean map, details on interaction. (3) Selective labeling - label large/important states directly, small states on hover. (4) Companion list/table - map + sorted table of state names and values. (5) Inset boxes for tiny Northeast states - enlarge Connecticut, Rhode Island, Delaware, New Hampshire area for readability. Best practice: abbreviations directly on states (small but readable), full names + values in tooltips on hover, sortable table below map for exact values. Accessibility: not everyone can identify states by shape alone (especially non-US audiences, younger users), labels make map self-documenting. Include DC (District of Columbia) if relevant to dataset.",
        "💡 <strong>Add tooltips showing state name, exact value, and contextual metrics:</strong> Tooltip content strategy when hovering over state: Minimum: state name + primary metric ('California: $78,672'). Better: state name, primary metric, rank, percentage ('California: $78,672 median income, Rank #6, 124% of national average'). Best: state name, primary metric, rank, context, trend ('California: $78,672 median income, Rank #6, 124% of US avg ($63,179), Up 4.2% vs last year'). Format for readability: large primary value, secondary info smaller, use separators/bullets for multiple metrics. Consider: comparison to national average (contextualizes if value is high/low), rank (position among 50 states), change over time (trend arrow ↑↓), related metrics (unemployment rate alongside income). Interactive features: click to highlight state + show detail panel, click to lock tooltip (for mobile), click to drill down to county level if available. Tooltip timing: instant show on hover, 200ms delay before hide (prevents flickering).",
        "💡 <strong>Design legend with clear value ranges and consider colorblind-safe palettes:</strong> Legend essentials: (1) Position - top right or bottom left of map (doesn't obscure states). (2) Orientation - vertical gradient (low at bottom, high at top) matches mental model, horizontal acceptable if space-constrained. (3) Labels - show min/max values clearly, include 2-3 intermediate values for reference, include units ('per capita', '%', '$'). (4) No data category - if some states missing data, include in legend ('Gray: No data available'). Colorblind accessibility: 8% of men have red-green colorblindness. Solutions: use blue-orange diverging scales instead of red-green, include patterns/textures in addition to color (solid, striped, dotted states), test with colorblind simulator tools (Coblis, Color Oracle). Single-hue sequential scales (blue, orange, purple gradients) generally colorblind-safe. Avoid: red-green as only differentiator, similar hues (light blue vs light purple hard to distinguish), gradients with too subtle changes. Provide: alternate high-contrast mode if possible.",
        "💡 <strong>Consider adding regional boundaries or groupings for strategic analysis:</strong> Regional grouping adds analytical layer beyond individual states: Census Bureau regions (Northeast, Midwest, South, West), sales territories (Eastern, Central, Western divisions), custom strategic regions (coastal vs inland, swing states vs safe states). Visualization techniques: (1) Boundary lines - draw thick borders between regions while keeping state borders thin, different from state borders. (2) Background shading - subtle region background color behind state choropleth (Northeast light blue background, South light yellow background). (3) Region labels - text labels for each region area ('Midwest', 'South'). (4) Grouping in legend/analysis - calculate regional averages, show region summaries alongside state details. Use cases: comparing regional performance (West outperforms East), identifying regional patterns (coastal states have X, inland have Y), aligning with organizational structure (sales regions match map regions). Implementation: add 'region' field to data, enable regional aggregation/filtering, regional summary statistics in dashboard. Caution: don't let regional grouping obscure state-level detail (primary focus)."
      ]
    },
    {
      "title": "When to Use This Tool",
      "type": "list",
      "content": [
        "<strong>Demographics & Population Analysis:</strong> Visualize population density, age distribution, or racial demographics across states for market sizing, display median household income, poverty rates, or education levels revealing economic opportunity disparities, show migration patterns with color intensity indicating net population inflow or outflow by state, analyze housing costs, homeownership rates, or urbanization levels for real estate investment targeting across different state markets",
        "<strong>Sales & Business Territories:</strong> Display revenue or sales volume by state identifying top-performing territories and geographic gaps, visualize market penetration rates showing states with high vs low customer density relative to population, show sales team performance by assigned territories color-coded by quota attainment percentages, analyze customer acquisition costs or lifetime value by state revealing geographic ROI disparities for marketing budget allocation decisions",
        "<strong>Political & Election Data:</strong> Map election results by state showing vote share, margins, or electoral college allocations for political analysis, visualize voter registration rates, turnout percentages, or party affiliation distributions across states, display policy positions or legislation status (states with/without certain laws) for advocacy campaign targeting, show polling data or approval ratings by state for political strategy and resource allocation in campaigns",
        "<strong>Public Health & Healthcare:</strong> Display disease prevalence rates, vaccination coverage, or health outcomes by state for public health planning, visualize healthcare access metrics (insured rate, doctors per capita, hospital beds) revealing care deserts, show COVID-19 cases, deaths, or testing rates by state during pandemic for resource allocation and policy decisions, analyze obesity rates, smoking prevalence, or exercise levels across states for wellness program targeting and health intervention prioritization",
        "<strong>Economic & Business Indicators:</strong> Map unemployment rates, GDP per capita, or economic growth by state for investment opportunity identification, display cost of living indices, tax rates, or business climate rankings informing relocation or expansion decisions, show industry concentration (manufacturing, tech, agriculture) by state color intensity revealing sector specialization patterns, visualize trade volumes, export values, or international investment by state for economic development strategy",
        "<strong>Environmental & Climate Data:</strong> Display average temperatures, precipitation levels, or extreme weather frequency by state for climate analysis, visualize renewable energy adoption rates, carbon emissions, or sustainability metrics across states, show natural disaster risk levels (earthquakes, hurricanes, floods) by state for insurance and emergency planning, analyze air quality indices, water quality, or environmental regulation strictness informing environmental policy and corporate sustainability initiatives"
      ]
    },
    {
      "title": "Related Tools",
      "type": "list",
      "content": [
        "Try our <a href='/charts/bar-chart'>Bar Chart Generator</a> for ranking states without geographic context",
        "Use our <a href='/charts/pie-chart'>Pie Chart Generator</a> for showing regional proportions as parts of whole",
        "Check our <a href='/charts/scatter-chart'>Scatter Chart</a> for exploring correlations between state-level variables",
        "Explore our <a href='/dev-tools/csv-formatter'>CSV Formatter</a> to prepare state-level data for map visualization"
      ]
    }
  ]
}
