{
  "id": "bar-chart",
  "title": "Bar Chart Generator",
  "description": "Create interactive bar charts from your data",
  "pageTitle": "Bar Chart Generator",
  "pageDescription": "Create interactive bar charts from your data. Bar charts are ideal for comparing discrete categories or showing rankings.",
  "chartDataTitle": "Chart Data",
  "chartDataDescription": "Configure your bar chart using JSON data or import from external sources",
  "exampleJson": "{\n  \"title\": \"Sales by Quarter\",\n  \"data\": [\n    { \"label\": \"Q1\", \"value\": 120, \"color\": \"#3b82f6\" },\n    { \"label\": \"Q2\", \"value\": 150, \"color\": \"#10b981\" },\n    { \"label\": \"Q3\", \"value\": 180, \"color\": \"#f59e0b\" },\n    { \"label\": \"Q4\", \"value\": 200, \"color\": \"#ef4444\" }\n  ]\n}",
  "exampleData": {
    "title": "Sales by Quarter",
    "data": [
      {
        "label": "Q1",
        "value": 120,
        "color": "#3b82f6"
      },
      {
        "label": "Q2",
        "value": 150,
        "color": "#10b981"
      },
      {
        "label": "Q3",
        "value": 180,
        "color": "#f59e0b"
      },
      {
        "label": "Q4",
        "value": 200,
        "color": "#ef4444"
      }
    ]
  },
  "category": "charts",
  "sections": [
    {
      "title": "Why Use This Tool?",
      "type": "list",
      "content": [
        "✓ Compare values across categories instantly with visual clarity - bar lengths make quantitative comparison immediate, perfect for sales by product, website traffic by source, survey responses by option without requiring viewers to parse numbers in tables",
        "✓ Show rankings and top performers for data-driven decisions - identify best-selling products, highest-performing team members, most popular content at a glance enabling quick prioritization and resource allocation in business reviews or performance dashboards",
        "✓ Handle large datasets with 10-50+ categories effectively - unlike pie charts limited to 3-6 slices, bar charts scale to dozens of categories while maintaining readability, ideal for product catalogs, country comparisons, or department-level reporting",
        "✓ Export professional charts for reports and presentations - download publication-ready bar charts as PNG or SVG for embedding in PowerPoint presentations, annual reports, research papers, marketing materials maintaining consistent branding and quality",
        "✓ 100% client-side processing keeps business intelligence secure - safely visualize confidential sales data, employee performance metrics, competitive analysis, financial results without uploading sensitive information to external analytics platforms"
      ]
    },
    {
      "title": "When to Use Bar Charts",
      "type": "list",
      "content": [
        "Comparing values across categories",
        "Showing rankings or top performers",
        "Displaying survey results",
        "Visualizing discrete data points"
      ]
    },
    {
      "title": "Data Structure",
      "type": "code",
      "content": [
        "{",
        "  \"title\": \"Sales by Quarter\",",
        "  \"data\": [",
        "    { \"label\": \"Q1\", \"value\": 120, \"color\": \"#3b82f6\" },",
        "    { \"label\": \"Q2\", \"value\": 150, \"color\": \"#10b981\" }",
        "  ]",
        "}"
      ]
    },
    {
      "title": "Common Questions",
      "type": "list",
      "content": [
        "<strong>Q: Should I use horizontal or vertical bars?</strong> Vertical bars (columns): best for time series (months, quarters, years), categorical data where labels are short (1-3 words), comparing 3-12 categories, traditional business presentation style. Horizontal bars: best for long category names (15+ characters like product names, city names), rankings (sorted from highest to lowest reads naturally top-to-bottom), 10+ categories (easier to fit labels), survey questions. Rule of thumb: if category labels overlap or require rotation in vertical chart, switch to horizontal. Vertical more common, but horizontal often more readable.",
        "<strong>Q: How do I choose between single bars vs grouped/stacked bars?</strong> Single bars: one value per category (sales by product). Grouped bars: multiple series per category side-by-side (Q1/Q2/Q3/Q4 sales for each product) - best for direct comparison within category, max 3-4 series. Stacked bars: series stacked vertically (quarterly sales stacked to show total) - shows part-to-whole and total, harder to compare middle segments. Use cases: single = simple comparison, grouped = comparing sub-categories, stacked = showing composition + total. Avoid grouped bars with 5+ series (too cluttered) - use line chart instead.",
        "<strong>Q: Should I start the Y-axis at zero or can I use a different baseline?</strong> Best practice: ALWAYS start at zero for bar charts. Reason: bar length represents magnitude, not position - starting at non-zero baseline (e.g., 80-100) exaggerates differences and misleads viewers. Example: sales of 90 vs 95 starting at 80 looks like 200% difference visually but is only 5.5% actual difference. Exception: line charts can use non-zero baseline because position matters, not length. If differences are small and starting at zero makes bars indistinguishable, your data may need different chart type (line chart with focused Y-axis) or display actual values on bars.",
        "<strong>Q: How many categories can I effectively show in a bar chart?</strong> Practical limits depend on orientation: vertical bars = 5-15 categories (more requires horizontal scrolling or tiny bars), horizontal bars = 10-50 categories (can scroll vertically or fit more on page). Beyond 50 categories: consider alternatives (treemap for hierarchical, heatmap for patterns, top-N + 'Others'). Best practice: if you have 100 products, show top 10 by revenue, group rest as 'Others'. Viewer attention span: most readers scan top 5-7 items, rest provides context but won't be studied closely.",
        "<strong>Q: What's the difference between bar charts and histograms?</strong> Bar chart: categorical X-axis (products, countries, survey options), gaps between bars, order can be rearranged (alphabetical, by value), compares discrete categories. Histogram: continuous X-axis (age ranges, price buckets, time intervals), no gaps between bars (represents continuous distribution), order is fixed (numerical), shows frequency distribution. Use bar chart for: 'Sales by product'. Use histogram for: 'Number of customers by age group (0-10, 10-20, 20-30)'. Histograms are statistical tool for understanding data distribution, bar charts are comparison tool for discrete categories."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "type": "list",
      "content": [
        "💡 <strong>Sort bars by value for rankings, keep categorical order for time/natural sequences:</strong> Two sorting strategies: (1) Sort by value (descending) for rankings, top-N lists, performance comparisons - makes highest/lowest immediately obvious, natural reading order. (2) Keep original order for time series (Jan, Feb, Mar), ordinal categories (Poor, Fair, Good, Excellent), geographic progression (East Coast to West Coast). Never: alphabetical sorting unless order is meaningless. Example: 'Top 10 Products by Revenue' = sort by revenue descending, 'Quarterly Revenue' = keep Q1, Q2, Q3, Q4 order. Pro tools allow manual drag-to-reorder for custom sequences.",
        "💡 <strong>Show data labels directly on bars for exact values:</strong> Visual comparison from bar length + exact numbers from data labels = best of both worlds. Label positioning: inside bar end (if space), outside bar end (if bar too short), or always outside for consistency. Format labels appropriately: $1.2M not $1,234,567, 23% not 0.23, 1.2k not 1,234. Include units (%, $, kg) to avoid ambiguity. For grouped/stacked bars: labels can clutter, consider showing on hover or for selected series only. Goal: viewer gets precise numbers without cross-referencing data table.",
        "💡 <strong>Use consistent colors with semantic meaning:</strong> Color strategies: (1) Single color for single series - all bars same color (professional, not distracting), vary saturation for emphasis. (2) Color by category for multiple series - consistent mapping (Product A = blue everywhere). (3) Diverging colors for positive/negative - green for profit, red for loss. (4) Gradient for ordered data - light to dark for low to high values. Avoid: random rainbow colors (looks unprofessional), red/green for non-sentiment data (colorblind issue). Accessibility: ensure 4.5:1 contrast, use patterns in addition to color for colorblind viewers.",
        "💡 <strong>Add reference lines for context and benchmarks:</strong> Reference lines (horizontal lines across chart) provide comparison points: target/goal line (sales target, budget cap), average line (mean of all bars), previous period comparison (last year same metric), industry benchmark (competitor average). Label clearly: 'Target: $500k', not just line. Use dashed or dotted style to distinguish from data. Color: neutral gray or brand color. Reference lines answer: 'Are we above/below target?' at glance. Most valuable in executive dashboards and performance reviews.",
        "💡 <strong>Consider logarithmic scale for wide value ranges:</strong> Problem: if one bar is $10M and another $10k, linear scale makes $10k invisible (looks like zero). Solution: logarithmic Y-axis where each tick is 10x previous (1, 10, 100, 1k, 10k, 100k, 1M, 10M). Pros: all values visible, shows relative differences. Cons: less intuitive (must be labeled clearly), can mislead casual viewers. Use when: values span 3+ orders of magnitude (1 to 1000), all values are same sign (log doesn't work with negatives or zero). Always label as 'Logarithmic Scale' prominently. Alternative: show top values on one chart, bottom values on separate chart with different scale."
      ]
    },
    {
      "title": "When to Use This Tool",
      "type": "list",
      "content": [
        "<strong>Sales & Performance Analysis:</strong> Compare revenue by product line or sales by salesperson to identify top performers, visualize monthly or quarterly sales trends for business reviews, show sales by region or market segment for geographic analysis",
        "<strong>Survey & Research Data:</strong> Display survey response distributions across multiple choice questions, visualize rating distributions (1-5 stars) for products or services, show demographic breakdowns or preference comparisons from research studies",
        "<strong>Website & Marketing Analytics:</strong> Compare traffic sources (organic, direct, referral, social) to understand acquisition, visualize conversion rates by channel or campaign performance metrics, show engagement metrics (page views, time on site) across content categories",
        "<strong>Financial Reporting:</strong> Display expense categories for budget analysis and cost optimization, compare revenue streams or profit margins across business units, visualize year-over-year growth or quarterly performance comparisons",
        "<strong>Operations & Logistics:</strong> Show inventory levels across product categories or warehouse locations, visualize production output by factory or manufacturing line, display delivery times or fulfillment rates across regions",
        "<strong>HR & Team Analytics:</strong> Compare team productivity metrics or project completion rates, visualize employee engagement scores or satisfaction survey results, show hiring pipeline stages or recruitment source effectiveness"
      ]
    },
    {
      "title": "How to Use (Example + FAQs)",
      "type": "list",
      "content": [
        "<strong>Example:</strong> Use the Sales by Quarter sample to plot Q1–Q4 bars with distinct colors.",
        "<strong>Step-by-step:</strong> (1) Add a chart title. (2) Add label/value pairs in the data array. (3) Render and sort if needed.",
        "<strong>FAQ:</strong> <em>Can I show long labels?</em> Yes—switch to horizontal bars if labels overlap.",
        "<strong>FAQ:</strong> <em>Should I start at zero?</em> Yes, bar charts should start at zero to avoid misleading comparisons.",
        "<strong>FAQ:</strong> <em>How many categories is too many?</em> If labels crowd, show top items and group the rest as “Other.”"
      ]
    },
    {
      "title": "Related Tools",
      "type": "list",
      "content": [
        "Try our <a href='/charts/line-chart'>Line Chart Generator</a> for showing trends over time with connected data points",
        "Use our <a href='/charts/pie-chart'>Pie Chart Generator</a> for parts-of-a-whole relationships with 3-6 categories",
        "Check our <a href='/charts/scatter-chart'>Scatter Chart</a> for exploring correlations between two variables",
        "Explore our <a href='/dev-tools/csv-formatter'>CSV Formatter</a> to prepare and validate data before charting"
      ]
    },
    {
      "title": "Quick Tips & Navigation",
      "type": "list",
      "content": [
        "Browse <a href=\"/charts\">all chart options</a> to pick the right visual fast.",
        "Need comparisons? Try the <a href=\"/charts/bar-chart\">Bar Chart</a> for side-by-side categories.",
        "For timelines, use the <a href=\"/charts/gantt-chart\">Gantt Chart</a> to track phases.",
        "Map-focused projects can jump to the <a href=\"/charts/usa-map\">USA Map Visualizer</a>."
      ]
    }
  ]
}
