{
  "id": "speed",
  "title": "Speed Converter",
  "description": "Speed conversion is essential for transportation, physics, engineering, and navigation across different measurement systems.",
  "category": "unit-conversions",
  "icon": "Gauge",
  "units": [
    {
      "value": "mps",
      "label": "Meters per Second",
      "abbreviation": "m/s",
      "factor": 1
    },
    {
      "value": "kph",
      "label": "Kilometers per Hour",
      "abbreviation": "km/h",
      "factor": 0.277778
    },
    {
      "value": "mph",
      "label": "Miles per Hour",
      "abbreviation": "mph",
      "factor": 0.44704
    },
    {
      "value": "fps",
      "label": "Feet per Second",
      "abbreviation": "ft/s",
      "factor": 0.3048
    },
    {
      "value": "knots",
      "label": "Knots",
      "abbreviation": "kn",
      "factor": 0.514444
    },
    {
      "value": "mach",
      "label": "Mach (at sea level)",
      "abbreviation": "Ma",
      "factor": 343
    },
    {
      "value": "c",
      "label": "Speed of Light",
      "abbreviation": "c",
      "factor": 299792458
    }
  ],
  "baseUnit": "mps",
  "defaultFromUnit": "mph",
  "defaultToUnit": "kph",
  "sections": [
    {
      "title": "Speed Units",
      "content": [
        "Metric: Meters per second (m/s), Kilometers per hour (km/h)",
        "Imperial: Miles per hour (mph), Feet per second (ft/s)",
        "Nautical: Knots (kn) - used in aviation and marine navigation",
        "Scientific: Mach (speed of sound), Speed of light (c)"
      ]
    },
    {
      "title": "Conversion Examples",
      "content": [
        "60 mph = 96.56 km/h = 26.82 m/s",
        "100 km/h = 62.14 mph = 27.78 m/s",
        "1 knot = 1.852 km/h = 1.151 mph",
        "Mach 1 = 343 m/s = 1,235 km/h = 767 mph"
      ]
    },
    {
      "title": "Use Cases",
      "content": [
        "Vehicle speed limit conversions",
        "Aviation and marine navigation",
        "Physics and engineering calculations",
        "Sports performance measurements",
        "Weather and wind speed reporting"
      ]
    },
    {
      "title": "Why Use This Tool?",
      "content": [
        "✓ <strong>International Travel Made Easy:</strong> Instantly understand speed limits when driving abroad whether you're converting 70 mph US highways to European km/h or vice versa",
        "✓ <strong>Aviation Precision:</strong> Pilots and aviation enthusiasts can quickly convert between knots, mph, and km/h for flight planning, weather reports, and navigation calculations without mental arithmetic",
        "✓ <strong>Athletic Performance:</strong> Track running pace in m/s for scientific training analysis or convert marathon speeds between min/km and mph for race strategy planning",
        "✓ <strong>Weather Understanding:</strong> Make sense of hurricane wind speeds whether reported in mph, km/h, or knots by seeing all equivalent values simultaneously",
        "✓ <strong>Engineering Accuracy:</strong> Calculate projectile velocities, vehicle dynamics, or fluid flow rates across different unit systems without conversion formula lookups"
      ]
    },
    {
      "title": "Common Questions",
      "content": [
        "<strong>Q: Why do pilots and sailors use knots instead of mph or km/h?</strong><br>Knots directly relate to nautical miles, where one knot equals one nautical mile per hour. A nautical mile is based on Earth's geometry with one minute of latitude equaling one nautical mile, making navigation calculations simpler. When a ship travels at 20 knots for one hour, it covers 20 nautical miles on a chart. This geographic relationship makes knots invaluable for marine and aviation navigation where you're working with latitude and longitude coordinates constantly.",
        "<strong>Q: How do I convert my car's speedometer reading when traveling internationally?</strong><br>Most modern cars show both mph and km/h on the speedometer, but if yours doesn't, remember the quick rule: multiply mph by 1.6 to get km/h, or divide km/h by 1.6 to get mph. So 60 mph is roughly 96 km/h, and 100 km/h is about 62 mph. For precision, use this converter before your trip to create a mental cheat sheet of common speeds like 30, 50, 70, and 90 mph in km/h.",
        "<strong>Q: What does Mach number actually mean and when should I use it?</strong><br>Mach number represents speed relative to the speed of sound, which varies with altitude and temperature. At sea level, Mach 1 equals roughly 767 mph or 1,235 km/h. Fighter jets at Mach 2 travel twice the speed of sound. It's crucial for aerospace engineering because aerodynamics change dramatically at transonic and supersonic speeds. Use Mach for aircraft performance above 250 mph where compressibility effects matter.",
        "<strong>Q: How fast is the speed of light in everyday terms?</strong><br>Light travels at 299,792,458 meters per second, which equals about 670,616,629 mph or 1,079,252,848 km/h. To put this in perspective, light could circle Earth's equator 7.5 times in one second. This converter helps physics students and space enthusiasts understand relativistic speeds by showing light speed in more familiar units, though nothing with mass can actually reach this speed.",
        "<strong>Q: Why do runners measure pace in min/km or min/mile instead of speed?</strong><br>While this converter shows speed units, runners often think in pace because it's easier to maintain a consistent effort level and plan race strategy. A 5-minute kilometer pace equals 12 km/h or 7.5 mph. Elite marathoners run at roughly 20 km/h or 12.4 mph for over two hours. Convert between speed and pace by calculating 60 divided by your speed in km/h to get minutes per kilometer."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "content": [
        "💡 <strong>Quick Mental Conversion:</strong> To estimate mph to km/h, use the 8:5 ratio. 80 mph is roughly 128 km/h because 80 × 8/5 = 128. For km/h to mph, multiply by 5/8 or simply multiply by 0.6. This works great for highway speeds without needing exact calculations.",
        "💡 <strong>Aviation Safety Margin:</strong> When converting wind speeds for flight planning, always round up to the nearest 5 knots for safety margins. A 23-knot crosswind should be treated as 25 knots in your calculations to ensure you have adequate safety buffer for landing decisions.",
        "💡 <strong>Running Pace Conversion:</strong> To convert speed to running pace, divide 60 by your speed in km/h. If you run at 10 km/h, your pace is 6 minutes per kilometer. For mph, divide 26.8 by your mph to get minutes per kilometer (10 mph = 2.68 min/km).",
        "💡 <strong>Understanding Scale:</strong> Remember that meters per second sounds slower than km/h because the units are smaller. 10 m/s equals 36 km/h or 22.4 mph, which is a decent cycling speed. Use m/s for physics problems and scientific measurements, km/h or mph for everyday speeds.",
        "💡 <strong>Nautical Navigation:</strong> When planning boat trips, convert your speed to knots first, then multiply by hours to get nautical miles covered. This works perfectly with marine charts that show distances in nautical miles. A 15-knot cruise over 4 hours equals 60 nautical miles traveled."
      ]
    },
    {
      "title": "When to Use This Tool",
      "content": [
        "<strong>International Driving:</strong> Converting speed limits before road trips in countries using different measurement systems, understanding rental car speedometers, or planning highway routes with accurate time estimates based on local speed units.",
        "<strong>Flight Planning:</strong> Pilots converting true airspeed from knots to other units, calculating groundspeed with wind corrections, understanding weather reports showing wind speeds in different units, or filing flight plans with accurate speed data.",
        "<strong>Marine Navigation:</strong> Boat captains calculating arrival times using knot-based speeds, understanding current speeds in different units, planning fuel consumption based on cruising speed, or coordinating with coast guard reports using various speed measurements.",
        "<strong>Sports Analytics:</strong> Coaches analyzing sprint speeds in m/s for biomechanical studies, converting cycling speeds between km/h and mph for training zones, tracking swimming velocities for performance optimization, or comparing athlete performance across international competitions.",
        "<strong>Weather Analysis:</strong> Meteorologists converting hurricane wind speeds between units for public safety announcements, understanding tornado ratings that use different speed scales, analyzing storm movement speeds, or interpreting aviation weather reports with wind speeds in knots.",
        "<strong>Physics Education:</strong> Students solving mechanics problems requiring consistent units, calculating projectile velocities, understanding relative motion scenarios, or working with energy calculations that need speed in specific units like m/s for kinetic energy formulas."
      ]
    },
    {
      "title": "Related Tools",
      "content": [
        "Need to calculate distances? Our <a href='/unit-conversions/distance'>Distance Converter</a> helps you work with miles, kilometers, nautical miles, and more.",
        "Working with acceleration? Check the <a href='/unit-conversions/acceleration'>Acceleration Converter</a> to handle changes in velocity over time for physics and engineering applications.",
        "Planning travel times? Use our <a href='/calculators/travel-time-calculator'>Travel Time Calculator</a> to estimate journey durations based on speed and distance.",
        "Converting fuel efficiency? Try our <a href='/unit-conversions/fuel-economy'>Fuel Economy Converter</a> to switch between MPG, L/100km, and other efficiency units."
      ]
    },
    {
      "title": "Quick Tips & Navigation",
      "type": "list",
      "content": [
        "Need another measurement? <a href=\"/unit-conversions/length\">Length Converter</a> handles meters, miles, and feet.",
        "Planning data/file work? Jump to <a href=\"/unit-conversions/data\">Data Size Converter</a> for bytes through gigabytes.",
        "Check rates with the <a href=\"/unit-conversions/currency\">Currency Converter</a> before quotes or invoices.",
        "Browse <a href=\"/unit-conversions\">all unit converters</a> for quick category switching on mobile."
      ]
    }
  ]
}
