{
  "id": "recipe-scaler",
  "title": "Recipe Scaler",
  "description": "Scale recipe ingredients for any number of servings",
  "pageTitle": "Recipe Scaler",
  "pageDescription": "Scale recipe ingredients for any number of servings",
  "aboutTitle": "About Recipe Scaler",
  "aboutDescription": "Easily scale recipe ingredients for any number of servings. Perfect for holiday cooking, meal prep, or adjusting recipes for different group sizes.",
  "category": "helpful-calculators",
  "sections": [
    {
      "title": "How to Use (Example + FAQs)",
      "type": "list",
      "content": [
        "<strong>Example:</strong> Scale a 4-serving recipe to 10 servings and review the updated ingredient list.",
        "<strong>Step-by-step:</strong> (1) Enter original servings. (2) Add ingredients. (3) Set target servings and scale.",
        "<strong>FAQ:</strong> <em>Do fractions work?</em> Yes—1/2 and 1 1/2 are supported.",
        "<strong>FAQ:</strong> <em>Do cook times scale?</em> Not linearly; use doneness checks.",
        "<strong>FAQ:</strong> <em>Can I change units?</em> Keep your preferred units and convert separately if needed."
      ]
    },
    {
      "title": "Entering Amounts",
      "content": [
        "The calculator accepts multiple formats: whole numbers (2), decimals (1.5), simple fractions (1/2), and mixed numbers (1 1/2). Common fractions like 1/4, 1/3, 1/2, 2/3, and 3/4 are preserved in the output when possible for easier measuring."
      ]
    },
    {
      "title": "Holiday Cooking Tips",
      "content": [
        "When cooking for holiday gatherings, remember that some recipes scale linearly while others (especially baked goods) may need adjustments",
        "Baking times often don't scale proportionally - a doubled recipe may need only 50% more time",
        "Always check for doneness using temperature or visual cues rather than relying solely on time"
      ]
    },
    {
      "title": "Why Use This Tool?",
      "content": [
        "✓ <strong>Consistent Results:</strong> Prevent overly salty or dry dishes by precisely scaling every ingredient instead of estimating.",
        "✓ <strong>Waste Reduction:</strong> Make just enough food for your group size and reduce leftovers or shortages.",
        "✓ <strong>Prep Efficiency:</strong> Generate adjusted shopping lists before heading to the store or placing delivery orders.",
        "✓ <strong>Recipe Sharing:</strong> Send correctly scaled versions to friends with different household sizes.",
        "✓ <strong>Budget Friendly:</strong> Align ingredient quantities with your budget and pantry inventory."
      ]
    },
    {
      "title": "Common Questions",
      "content": [
        "<strong>Q: Do cook times change when scaling?</strong><br>Often yes. Double batches may need wider pans or slightly longer cooking but rarely double the time. Always check doneness by temperature and texture rather than clock time alone.",
        "<strong>Q: How do I handle spices?</strong><br>For strong spices or salt, scale slightly less than linear for huge batches, then adjust to taste at the end.",
        "<strong>Q: What about baking?</strong><br>Baked goods are sensitive. Scale carefully, keep ratios intact, and bake in multiple pans rather than one massive pan when possible.",
        "<strong>Q: Can I switch units?</strong><br>Record ingredients in the units you measure with. If you need conversions, pair this with a unit converter or standard kitchen conversion chart.",
        "<strong>Q: How do fractions display?</strong><br>The tool preserves common kitchen fractions for readability, so you'll see friendly measurements like 1/4 cup instead of 0.25 cup when possible."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "content": [
        "💡 <strong>Scale Sauces Separately:</strong> Some sauces and glazes need slight thickening adjustments—add liquids gradually after scaling.",
        "💡 <strong>Batch in Rounds:</strong> For very large groups, cook in multiple batches to maintain texture and food safety.",
        "💡 <strong>Use Weight for Precision:</strong> Convert key ingredients (flour, sugar, protein) to grams for the most reliable results.",
        "💡 <strong>Label Changes:</strong> When sharing, note the original and target servings so others know the context of quantities.",
        "💡 <strong>Test First:</strong> For special events, test a scaled version in advance to confirm flavor and timing."
      ]
    },
    {
      "title": "When to Use This Tool",
      "content": [
        "<strong>Meal Prep:</strong> Doubling recipes for weekly lunches while keeping nutrition consistent across portions.",
        "<strong>Holidays & Parties:</strong> Expanding family recipes to feed larger gatherings without losing balance.",
        "<strong>Small Households:</strong> Scaling down large recipes to avoid food waste and fridge overload.",
        "<strong>Budget Planning:</strong> Matching ingredient amounts to weekly grocery budgets by adjusting servings.",
        "<strong>Recipe Testing:</strong> Standardizing portions when adapting recipes for blogs, cookbooks, or catering menus."
      ]
    },
    {
      "title": "Related Tools",
      "content": [
        "Need cooking unit conversions? Pair with the <a href='/unit-conversions/volume'>Volume Converter</a> for fluid measures.",
        "Planning a holiday meal? Check the <a href='/helpful-calculators/holiday-countdown'>Holiday Countdown</a> to time prep milestones.",
        "Sharing instructions? Export scaled results and attach them to a <a href='/helpful-calculators/cheatsheet-builder'>Cheatsheet Builder</a> template.",
        "Need a printable summary? Build a quick handout with the <a href='/helpful-calculators/cheatsheet-builder'>Cheatsheet Builder</a>."
      ]
    },
    {
      "title": "Quick Tips & Navigation",
      "type": "list",
      "content": [
        "Browse <a href=\"/helpful-calculators\">all helpful calculators</a> for quick everyday solves.",
        "Secure logins with the <a href=\"/helpful-calculators/password-generator\">Password Generator</a>.",
        "Plan gatherings via the <a href=\"/helpful-calculators/secret-santa\">Secret Santa Generator</a>.",
        "Scale cooking fast with the <a href=\"/helpful-calculators/recipe-scaler\">Recipe Scaler</a>."
      ]
    }
  ]
}
