{
  "id": "pressure",
  "title": "Pressure Converter",
  "description": "Pressure conversion is essential for engineering, meteorology, and scientific applications across different measurement systems.",
  "category": "unit-conversions",
  "icon": "Gauge",
  "units": [
    {
      "value": "Pa",
      "label": "Pascal",
      "abbreviation": "Pa",
      "factor": 1
    },
    {
      "value": "hPa",
      "label": "Hectopascal",
      "abbreviation": "hPa",
      "factor": 100
    },
    {
      "value": "kPa",
      "label": "Kilopascal",
      "abbreviation": "kPa",
      "factor": 1000
    },
    {
      "value": "MPa",
      "label": "Megapascal",
      "abbreviation": "MPa",
      "factor": 1000000
    },
    {
      "value": "GPa",
      "label": "Gigapascal",
      "abbreviation": "GPa",
      "factor": 1000000000
    },
    {
      "value": "bar",
      "label": "Bar",
      "abbreviation": "bar",
      "factor": 100000
    },
    {
      "value": "mbar",
      "label": "Millibar",
      "abbreviation": "mbar",
      "factor": 100
    },
    {
      "value": "atm",
      "label": "Atmosphere",
      "abbreviation": "atm",
      "factor": 101325
    },
    {
      "value": "psi",
      "label": "Pounds per Square Inch",
      "abbreviation": "psi",
      "factor": 6894.757293168
    },
    {
      "value": "ksi",
      "label": "Kilo PSI",
      "abbreviation": "ksi",
      "factor": 6894757.293168
    },
    {
      "value": "torr",
      "label": "Torr",
      "abbreviation": "torr",
      "factor": 133.3223684211
    },
    {
      "value": "mmHg",
      "label": "Millimeters of Mercury",
      "abbreviation": "mmHg",
      "factor": 133.322387415
    },
    {
      "value": "inHg",
      "label": "Inches of Mercury",
      "abbreviation": "inHg",
      "factor": 3386.38815789
    },
    {
      "value": "inH2O",
      "label": "Inches of Water",
      "abbreviation": "inH2O",
      "factor": 249.08891
    },
    {
      "value": "kgfcm2",
      "label": "Kilogram-force per cm²",
      "abbreviation": "kgf/cm²",
      "factor": 98066.5
    }
  ],
  "baseUnit": "Pa",
  "defaultFromUnit": "Pa",
  "defaultToUnit": "psi",
  "sections": [
    {
      "title": "Pressure Units",
      "content": [
        "SI: Pascal (Pa), Kilopascal (kPa), Megapascal (MPa)",
        "Metric: Bar, Millibar",
        "Imperial: Pounds per square inch (psi)",
        "Scientific: Atmosphere (atm), Torr, Millimeters of mercury (mmHg)"
      ]
    },
    {
      "title": "Conversion Examples",
      "content": [
        "1 atmosphere = 101,325 Pa = 101.325 kPa = 1.01325 bar",
        "1 bar = 100,000 Pa = 14.504 psi",
        "1 psi = 6,894.76 Pa = 0.0689476 bar",
        "1 torr = 133.322 Pa = 1 mmHg"
      ]
    },
    {
      "title": "Use Cases",
      "content": [
        "Tire pressure measurements",
        "Weather forecasting and barometric pressure",
        "HVAC and pneumatic systems",
        "Scuba diving and altitude calculations",
        "Industrial and hydraulic systems"
      ]
    },
    {
      "title": "Why Use This Tool?",
      "content": [
        "✓ <strong>Tire Safety:</strong> Convert between psi and bar when your tire sidewall shows one unit but your gauge measures another, ensuring proper inflation for fuel efficiency and safety",
        "✓ <strong>Weather Analysis:</strong> Understand barometric pressure readings from different sources, whether shown in millibars, inches of mercury, or kilopascals for accurate storm tracking",
        "✓ <strong>Scuba Diving:</strong> Calculate safe diving depths and tank pressures by converting between bar, psi, and atmospheres for proper equipment setup and decompression planning",
        "✓ <strong>Industrial Equipment:</strong> Specify hydraulic and pneumatic system pressures correctly when working with international machinery that uses different pressure standards",
        "✓ <strong>Medical Applications:</strong> Convert blood pressure readings and medical gas cylinder pressures between mmHg, kPa, and psi for clinical accuracy across different measurement systems"
      ]
    },
    {
      "title": "Common Questions",
      "content": [
        "<strong>Q: What's the correct tire pressure and how do I convert between psi and bar?</strong><br>Most passenger car tires require 30-35 psi, which equals 2.07-2.41 bar or 207-241 kPa. Your vehicle's recommended pressure is on a sticker inside the driver's door jamb. European cars often specify bar while US vehicles use psi. To convert, remember that 1 bar equals 14.5 psi, so 2.2 bar equals 32 psi. Always check tire pressure when cold, as driving heats tires and increases pressure by 2-4 psi, giving falsely high readings.",
        "<strong>Q: How does altitude affect pressure and my pressure cooker settings?</strong><br>Atmospheric pressure decreases with altitude. At sea level, standard pressure is 101.325 kPa or 1 atmosphere. At 5,000 feet elevation, it drops to about 84 kPa. This affects cooking times because water boils at lower temperatures under reduced pressure. Pressure cookers create consistent high pressure (typically 15 psi or 103 kPa above atmospheric) regardless of altitude. When recipes specify pressure cooker settings in psi but your cooker shows bar, convert to ensure proper cooking pressure.",
        "<strong>Q: Why do weather reports use different pressure units?</strong><br>Weather stations worldwide use millibars (mbar) or hectopascals (hPa), which are equivalent: 1 mbar = 1 hPa. US weather reports might show inches of mercury (inHg), where 29.92 inHg equals standard sea-level pressure of 1013.25 mbar. Low pressure systems below 1000 mbar indicate storms, while high pressure above 1020 mbar suggests fair weather. Converting between units helps when comparing forecasts from international sources or understanding barometric trends for fishing and outdoor activities.",
        "<strong>Q: What pressure units do scuba divers use and why?</strong><br>Scuba diving primarily uses bar for tank pressure and depth calculations. A full tank holds about 200 bar (2,900 psi). Water pressure increases by 1 bar every 10 meters (33 feet) of depth. At 30 meters, you experience 4 bar total pressure (1 bar atmospheric plus 3 bar from water). Understanding these conversions is critical for calculating air consumption, no-decompression limits, and safe ascent rates. US divers often use psi for tank pressure but bar for depth calculations, requiring frequent conversions.",
        "<strong>Q: How do I interpret vacuum pressure readings?</strong><br>Vacuum pressure represents pressure below atmospheric. It's often expressed as negative gauge pressure or as absolute pressure approaching zero. A perfect vacuum would be 0 Pa absolute or -101.325 kPa gauge pressure at sea level. Industrial vacuum systems might operate at 20 kPa absolute (about 80% vacuum) or show -81 kPa on a gauge. Converting between absolute and gauge pressure requires knowing local atmospheric pressure. Medical suction devices typically operate at -40 to -60 kPa gauge pressure."
      ]
    },
    {
      "title": "Pro Tips & Best Practices",
      "content": [
        "💡 <strong>Tire Pressure Memory:</strong> Remember the easy conversion that 30 psi equals roughly 2 bar (actually 2.07). Most car tires fall between 2.0-2.5 bar or 29-36 psi. Increase pressure by 0.2 bar (3 psi) when carrying heavy loads or before long highway trips for better fuel economy and tire longevity.",
        "💡 <strong>Weather Prediction:</strong> Rapidly falling barometric pressure (dropping more than 3 mbar per hour) signals approaching storms. A change from 1020 mbar to 1000 mbar in 12 hours indicates significant weather deterioration. Track pressure trends rather than absolute values for accurate local forecasting without expensive equipment.",
        "💡 <strong>Gauge vs Absolute:</strong> Most pressure gauges show gauge pressure (pressure above atmospheric), not absolute pressure. A tire gauge reading 32 psi shows 32 psi gauge, but absolute pressure is 32 + 14.7 = 46.7 psi. For scientific calculations, always clarify whether measurements are gauge or absolute pressure to avoid serious errors.",
        "💡 <strong>Hydraulic Safety:</strong> Industrial hydraulic systems operate at extremely high pressures, often 3,000 psi (207 bar) or more. At these pressures, even pin-hole leaks can inject fluid through skin, causing severe injury. Always convert pressure ratings to your gauge's units and never exceed equipment ratings. A system rated for 200 bar cannot safely handle 3,000 psi (207 bar is the limit).",
        "💡 <strong>Compressor Selection:</strong> Air compressors rate output in psi or bar. Most pneumatic tools need 90 psi (6.2 bar) minimum to operate properly. When buying a compressor, ensure it delivers required pressure at your tools' consumption rate (CFM or L/min). A compressor rated 150 psi maximum might only deliver 90 psi continuously under load."
      ]
    },
    {
      "title": "When to Use This Tool",
      "content": [
        "<strong>Automotive Maintenance:</strong> Setting correct tire pressures when traveling internationally with different measurement standards, checking tire pressure before long trips, maintaining proper inflation for fuel efficiency, or setting up aftermarket tire pressure monitoring systems with mixed units.",
        "<strong>Weather Monitoring:</strong> Comparing barometric readings from different weather stations using various units, predicting weather changes by tracking pressure trends, calibrating home weather stations, or understanding aviation weather reports (METAR) that use different pressure formats.",
        "<strong>Diving Operations:</strong> Calculating tank fill pressures when rental equipment uses different standards, planning dive profiles with accurate depth-pressure relationships, understanding nitrox mixing requirements, or converting between metric and imperial depth gauges for safety calculations.",
        "<strong>HVAC Systems:</strong> Specifying refrigerant pressures for air conditioning systems, troubleshooting compressor performance using manufacturer specs in different units, setting up vacuum pumps for system servicing, or comparing efficiency across equipment using various pressure standards.",
        "<strong>Industrial Manufacturing:</strong> Configuring pneumatic tools and systems with correct operating pressures, specifying hydraulic system components with accurate pressure ratings, setting up pressure relief valves and safety systems, or coordinating international equipment purchases with standardized specifications.",
        "<strong>Medical Equipment:</strong> Calibrating blood pressure monitors that display mmHg or kPa, setting oxygen cylinder regulators with proper delivery pressures, configuring surgical suction equipment, or understanding respiratory therapy equipment specifications across different healthcare systems."
      ]
    },
    {
      "title": "How to Use (Example + FAQs)",
      "type": "list",
      "content": [
        "<strong>Example:</strong> Convert 32 psi to kPa for a tire inflator.",
        "<strong>Step-by-step:</strong> (1) Enter the pressure. (2) Choose units. (3) Read the result.",
        "<strong>FAQ:</strong> <em>Which unit do car tires use?</em> PSI is common in the US; kPa in many other regions.",
        "<strong>FAQ:</strong> <em>Is bar the same as atm?</em> They’re close but not equal—use the converter for precision.",
        "<strong>FAQ:</strong> <em>Does temperature affect pressure?</em> Yes—pressure changes with temperature and volume."
      ]
    },
    {
      "title": "Related Tools",
      "content": [
        "Working with gases? Our <a href='/unit-conversions/temperature'>Temperature Converter</a> helps with gas law calculations requiring Kelvin, Celsius, or Fahrenheit.",
        "Calculating forces? Try our <a href='/unit-conversions/force'>Force Converter</a> to work with Newtons, pounds-force, and other force units.",
        "Need altitude conversions? Check our <a href='/calculators/altitude-calculator'>Altitude Calculator</a> for pressure-altitude relationships and aviation calculations.",
        "Measuring flow rates? Use our <a href='/unit-conversions/flow-rate'>Flow Rate Converter</a> for liters per minute, CFM, and volumetric flow calculations."
      ]
    },
    {
      "title": "Quick Tips & Navigation",
      "type": "list",
      "content": [
        "Need another measurement? <a href=\"/unit-conversions/length\">Length Converter</a> handles meters, miles, and feet.",
        "Planning data/file work? Jump to <a href=\"/unit-conversions/data\">Data Size Converter</a> for bytes through gigabytes.",
        "Check rates with the <a href=\"/unit-conversions/currency\">Currency Converter</a> before quotes or invoices.",
        "Browse <a href=\"/unit-conversions\">all unit converters</a> for quick category switching on mobile."
      ]
    }
  ]
}
